# for i in range(5):
#     print(i, end=" ")

# for i in range(5):
#     print(i)

# for i in "String":
#     print(i, end=" ")
#     print(1, end=" ")

# while True:
#     print(1) '''control+Z для принудит. отавновки цикла'''

# n = 10
# while n > 0:
#     print(1, end=" ")
#     n -= 1

# n = 10
# while n > 0:
#     if n % 2 == 0:
#         n -= 1
#         continue
#     elif n == 5:
#         break
#     print(n, end=" ")
#     n -= 3

# print(f'''
#       cghcgh
#       gh
#       vhv
#       hjfhj
#       ''')


#  Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).

#2
#  Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.

#3
#  Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.