# for i in range(5):
#     print(i, end=" ")

# for i in range(5):
#     print(i)

# for i in "String":
#     print(i, end=" ")
#     print(1, end=" ")

# while True:
#     print(1) '''control+Z для принудит. отавновки цикла'''

# n = 10
# while n > 0:
#     print(1, end=" ")
#     n -= 1

# n = 10
# while n > 0:
#     if n % 2 == 0:
#         n -= 1
#         continue
#     elif n == 5:
#         break
#     print(n, end=" ")
#     n -= 3

# print(f'''
#       cghcgh
#       gh
#       vhv
#       hjfhj
#       ''')


# # Tasks for lesson on the topic of "Loops: `for` and `while`"

# ```
# # для заданної кількості ітерацій
# for i in щось:
#     дія
# ```
# ```
# # поки умова виконується
# while умова:
#     дія
# ```

# *Beginner level*
# 1. Виведіть повідомлення `Hello, Python!` на екран n разів (`n` - ціле число, яке вводить користувач).

def task1():
    n = int(input("Enter number: "))
    for i in range(n):
        print("Hello, Python!")

# task1()

# 2. Дано два цілих числа `a` і `b` (a ≤ b). Виведіть всі числа від `a` до `b` включно.

def task2_1():
    a = int(input("Enter number a: "))
    b = int(input("Enter number b >= a: "))

    for i in range(a, b+1):
        print(i)

# task2_1()

def task2_2():
    a = int(input("Enter number a: "))
    b = int(input("Enter number b: "))

    i = a
    while i <= b:
        print(i)
        i += 1

# task2_2()

# 3. Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.

#     Вхідні дані:
#     ```
#     5
#     ```
#     Вихідні дані:
#     ```
#     5
#     4
#     3
#     2
#     1
#     Start!
#     ```

def task3_1():
    n = int(input("Enter sekund: "))

    for i in range(n, 0, -1):
        print(i)
    print("Start!") 

# task3_1()

def task3_2():
    n = int(input("Enter sekund: "))

    while n > 0:
        print(n)
        n -= 1    
    print("Start!")

# task3_2()

# 4. Користувач вводить кількість навчальних предметів `n`, а потім, відповідно, оцінки учня з `n` навчальних предметів. Визначте середню оцінку.

def task4():
    n = int(input("Enter count of lessons: "))
    result = 0
    for i in range(n):
        note = int(input("Enter the note:"))
        result += note
    print(result//n)

# task4()

# 5. Надрукувати у рядку `m` разів число `n`. Числа `m` і `n` - цілі числа, які вводить користувач у порядку `n`, `m`.

#     Вхідні дані:
#     ```
#     10
#     5
#     ```
#     Вихідні дані:
#     ```
#     10 10 10 10 10
#     ```

def task5():
    n = int(input("Enter number n: "))
    m = int(input("Enter number m: "))

    while m > 0:
        print(n, end=" ")
        m -= 1

# task5()

# 6. Напишіть програму для друку цілих чисел від `n` до 0 із виведенням біля кожного числа кількості символів `#`, що дорівнює значенню числа.

# Вхідні дані:
# ```
# 6
# ```
# Вихідні дані:
# ```
# 6 ######
# 5 #####
# 4 ####
# 3 ###
# 2 ##
# 1 #
# ```

def task6():
    n = int(input("Enter n:"))

    for i in range(n, -1, -1):
        print(i, "#" * i) 

# task6()

# 7. Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням `n`.

#     Вхідні дані:
#     ```
#     9
#     ```
#     Вихідні дані:
#     ```
#     1
#     22
#     333
#     4444
#     55555
#     666666
#     7777777
#     88888888
#     999999999
#     ```

def task7():
    n = int(input("Enter n:"))

    for i in range(1, n+1):
        print(str(i) * i)

# task7()


# *Middle level*

# 8. Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки `#`, коли на вхід програми подається ціле число `n` - кількість сходинок.

#     Вхідні дані:
#     ```
#     4
#     ```
#     Вихідні дані:
#     ```
#     #
#     ##
#     ###
#     ####
#     ```
def task8():
    n = int(input("Enter n:"))

    for i in range(1, n+1):
        print("#" * i)

# task8()

# 9. За даним цілим додатнім числом `n` обчисліть `n!` - значення факторіалу цього числа.
#     > Факторіал: **n! = 1 * 2 * 3 * ... * (n-1) * n**

def task9():
    n = int(input("Enter n:"))
    result = 1
    for i in range(n, 0, -1):
        result = result * i

    print(result)

# task9()

# 10. Автогонщик в перший день ралі проїхав `d` км. Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за всі дні перевищить `t` км і яке значення сумарного пробігу? Введення даних користувачем відбувається в порядку: `d`, `t`.

#     Вхідні дані:
#     ```
#     10
#     200
#     ```
#     Вихідні дані:
#     ```
#     213.84 km, 12 days
#     ```

def task10():
    d = int(input("Enter start length, km: "))
    t = int(input("Enter max length, km: "))
    days = 0

    while d <= t:
        d = d + d//10
        days +=1

    print(days)

# task10()

# 11. Дано ціле число `n`. З чисел 1, 4, 9, 16, 25, …​ надрукувати ті, які не перевищують `n`. *(зверніть увагу на задану послідовність)*

def tsk11():
    n = int(input("Enter n:"))

    numbers = [1, 4, 9, 16, 25]

    for i in numbers:
        if i < n:
            print(i)

#task11()

# 12. Дано цілі числа `a` і `b`. Обчислити a ^ b (a в степені b), не використовуючи операцію піднесення до степеня.

def task12():
    
    a = int(input("Enter a:"))
    b = int(input("Enter b:"))
    result = 1
    for i in range(b, 0, -1):
        result *= a

    print(result)

# task12()

# *Hard level*

# 13. Дано натуральне число `n`. Визначити, чи є воно автоморфним числом.  
# *Примітка: Автоморфне число - число, квадрат якого рівний останнім розрядами квадрата цього числа: 5 - 25, 6 - 36, 25 - 625.*

#     Вхідні дані:
#     ```
#     9376
#     ```
#     ```
#     26
#     ```
#     Вихідні дані:
#     ```
#     True
#     ```
#     ```
#     False
#     ```

# 14. Дано натуральне число n. Надрукуйте всі n-значні непарні натуральні числа в порядку спадання.

#     Вхідні дані:
#     ```
#     1
#     ```
#     ```
#     2
#     ```
#     Вихідні дані:
#     ```
#     9 7 5 3 1
#     ```
#     ```
#     99 97 95 93 91 89 87 85 83 81 79 77 75 73 71 69 67 65 63 61 59 57 55 53 51 49 47 45 43 41 39 37 35 33 31 29 27 25 23 21 19 17 15 13 11
#     ```

# 15. Написати програму для обчислення суми цифр цілого числа `n`. Програма має враховувати, що на вхід може подаватися ціле від’ємне число.
# 16. Напишіть програму для отримання рядка Фібоначчі від 0 до `n`, де `n` - ціле число.  
# *Послідовність Фібоначчі - це серія чисел 0, 1, 1, 2, 3, 5, 8, 13, 21, .... Кожне наступне число знайдено шляхом додавання двох номерів перед ним.*

#     Вхідні дані:
#     ```
#     50
#     ```
#     Вихідні дані:
#     ```
#     0 1 1 2 3 5 8 13 21 34
#     ```

# 17. За введеним користувачем цілим числом n визначте n-е число Фібоначчі.

#     Вхідні дані:
#     ```
#     9
#     ```
#     ```
#     3
#     ```
#     ```
#     5
#     ```
#     Вихідні дані:
#     ```
#     34
#     ```
#     ```
#     2
#     ```
#     ```
#     5
#     ```