# 1
# Напишіть програму, в якій користувач вводить пароль
# і якщо він співпадає із наперед визначеним паролем
# для цього користувача, то виводиться повідомлення
# Password accepted.. У іншому випадку повідомлення буде
# Sorry, that is the wrong password..

# password = input("Enter password ")
# password_correct = "TryUi7"

# if(password == password_correct):
#    print("Password accepted") 
# else:
#    print("Sorry, that is the wrong password")


# 2
# Користувачем вводиться два імені.
# Використовуючи конструкцію розгалуження програма повинна 
# вивести імена в алфавітному порядку.

# name1 = input("Enter name1: ")
# name2 = input("Enter name2: ")

# # # if(name1 <= name2):
# # #     print(name1, name2)
# # # else:
# # #     print(name2, name1)

# if name1 <= name2:
#     name1, name2 = name2, name1
# print(name2, name1)


# 3
# Напишіть програму, яка виводить назви введених чисел.
# Користувач вводить ціле число.
# Якщо це число або 1 або 2 або 3, то виводиться
# повідомлення - назва числа, відповідно, One, Two, Three.
# В усіх інших випадках виводиться слово Unknown.

# 



# 4
# Користувач вводить дві різних англійські літери
# в окремих рядках. Напишіть програму, яка виводить
# повідомлення про місце розташування однієї літери
# відносно іншої у алфавіті.

# letter1 = input("Enter letter1: ")
# letter2 = input("Enter letter2: ")


# if letter1 <= letter2:
#     print("First letter: ", letter1, "Second letter: ", letter2)
# else:    
#     print("First letter: ", letter2, "Second letter: ", letter1)

# не дописан код - посмотреть запись урока
# if letter1.lower() == letter2.lower():
#     if letter1 < letter2:
         
# elif letter1.lower() <= letter2.lower(): #игнорируем регистр буквы для сравнения места в алфавите 
#     print("First letter: ", letter1, "Second letter: ", letter2)
# else:    
#     print("First letter: ", letter2, "Second letter: ", letter1)


# 5
# Напишіть програму, в якій користувач вводить значення температури,
# і, якщо це значення менше або дорівнює 0 градусів Цельсія, необхідно 
# ивести повідомлення A cold, isn’t it?.
# Якщо ж температура становить більше 0 і менше 10 градусів Цельсія
# повідомлення буде Cool., у інших випадках Nice weather we’re having..

temperature = int(input("Enter Temperature: "))

# if temperature <= 0:
#     print("A cold, isn’t it?")
# elif temperature < 10:
#     print("Cool")
# else:
#     print("ice weather we’re having")


# Середній рівень

# Визначте назву геометричної фігури за введеною кількістю 
# її сторін. Програма повинна підтримувати фігури від 3 до 6
#  сторін. Якщо введена кількість сторін поза межами 
# цього діапазону, програма повинна відображати відповідне
# повідомлення.


# Ігрове поле рулетки поділено на номери від 0 до 36, які мають чорний, червоний або зелений кольори. 
# Номер 0 має зелений колір, для номерів від 1 до 10, 
# непарні номери - червоні, а парні - чорні. 
# Непарні номери від 11 до 18 - чорні, 
# а парні номери - червоні. Непарні номери від 19 до 28 
# - червоні, а парні номери - чорні. 
# Непарні номери від 29 до 36 - чорні, 
# а парні номери - червоні. Напишіть програму, 
# яка отримує номер (число від 0 до 36) та показує, 
# чи є номер зеленим, червоним або чорним. 
# Програма повинна враховувати варіант, 
# якщо користувач вводить номер, який знаходиться 
# за межами діапазону від 0 до 36.

