# Tasks for lesson on the topic of "list() | tuple()"

# Beginner level

# 1
# Створіть список на основі введеної послідовності цілих чисел і надрукуйте другу половину списку. Якщо кількість не парна, то вивести більшу кількість.

# value = "1 2 65 4 34 6 96 34 2 94 3"
# value_list = list(map(int, value.split()))
# print(value_list[len(value_list)//2:])


# 2
# Створіть список на основі введеної послідовності цілих чисел і надрукуйте його елементи таким чином: два останні елементи переміщені з кінця в початок списку без зміни їх початкового порядку.

# value = "1 2 65 4 34 6 96 34 2 94 3"
# value_list = list(map(int, value.split()))
# v_l2 = value_list[:-2]
# v_l1 = value_list[-2:]

# result = v_l1 + v_l2
# print(result)

# v_list = value_list[-2:]
# print(v_list)
# v_list.extend(v_l2)
# print(v_list)

# v_list.append(v_l2)
# print(v_list)
# v_list.append("try")
# print(v_list)

# list(map(int, list))

# 3
# Збережіть назви мов світу, які вводяться в одному рядку через пропуск, у списку. Простежте за тим, щоб елементи у списку не зберігались в алфавітному порядку. Відсортуйте список в алфавітному порядку і виведіть його елементи в рядку через пропуск.

# languages = "Ukrainian French Bulgarian Norwegian Latvian"
# list_lang = languages.split()
# list_lang.sort()
# # print(list_lang)
# print(" ".join(list_lang))

# languages = "Ukrainian French Bulgarian Norwegian Latvian"
# list_lang = languages.split()
# print(" ".join(sorted(list_lang)))

# 4
# Виведіть елементи списку в зворотному порядку, не змінюючи сам список.

# languages = "Ukrainian French Bulgarian Norwegian Latvian"
# list_lang = languages.split()
# list_lang.sort(reverse=True)
# # print(list_lang)
# print(" ".join(list_lang))



# languages = "Ukrainian French Bulgarian Norwegian Latvian"
# list_lang = languages.split()
# print(list_lang)

# print(" ".join(sorted(list_lang, reverse=True)))


# print(list_lang[::-1])

# 5
# Виведіть всі елементи списку з парними індексами. Вводиться список чисел. Всі числа списку знаходяться на одному рядку.


# 6
# изначте, скільки різних слів у введеному рядку.

# Вхідні дані:
# New Delhi New York Paris Prague Reykjavik
# Happy New Year Happy New Year May we all have a vision now and then Of a world where every neighbor is a friend

# Вихідні дані:
# 6
# 19


# text = "New Delhi New York Paris Prague Reykjavik"
# text = text.split()
# new_text = []
# for word in text:
#     if word not in new_text:
#         new_text.append(word)
# print(len(new_text))


# 7
# Напишіть програму, яка приймає послідовність чисел, розділених комами, від користувача і створює список і кортеж з цими числами.

# Вхідні дані:
# 7, 9, 12, 4

# Вихідні дані:
# [7, 9, 12, 4]
# (7, 9, 12, 4)


# 8
# Напишіть програму для отримання частини рядка URL, що позначає назву ресурсу.

# Вхідні дані:
# https://www.namesite.com/folder/index.html

# Вихідні дані:
# index.html



# Middle level

# 9
# Для введеної послідовності унікальних цілих чисел, поміняйте місцями мінімальний та максимальний елементи цієї послідовності. Надрукуйте отриманий список.


# 10
# Напишіть програму, яка приймає послідовність рядків (порожній рядок для завершення програми) як вхідний рядок і друкує рядки у верхньому регістрі.

# Вхідні дані:
# 
# ruby
# go

# Вихідні дані:
# PYTHON
# RUBY
# GO

#variant1:
#python
# while True:
#     line = input("Enter text: ")
#     if line == "":
#         break

#variant2:

# line = True
# while line != "":
#     line   input("Enter text: ")

#variant3: ігровий цикл

# run = True
# while run:
#     line == input("Enter text: ")
#     if line == "":
#         run = False

#вирішення:
# def task10():
#     lines = []
#     while True:
#         line = input("Enter text: ")
#         if line == "":
#             break
#         lines.append(line.upper())
        
#     for el in lines:
#         print(el)

# task10()


#11
# У введеному списку цілих чисел, знайдіть і надрукуйте сусідні елементи, які мають однаковий знак. Якщо такої пари немає, не повинно нічого виводитися.

# Вхідні дані:
# 1 -2 -3 5 6 -3 7 8

# Вихідні дані:
# -2 -3
# 5 6
# 7 8

# numbers = [1, -2, -3, 5, 6, -3, 7, 8]

# for i in range(len(numbers) - 1):
#     if numbers[i] * numbers[i + 1] > 0:
#         print(numbers[i], numbers[i + 1])


# 12
# Напишіть програму для обчислення добутку цілих чисел (без використання циклу for), які вводяться через пропуск користувачем в одному рядку.

# Вхідні дані:
# 2 5 3

# Вихідні дані:
# 30

#варіант вирішення через for ..in

# numbers = list(map(int, input("Enter list:").split())) #створюємо список із введенних значень в строку(де розділювач це пробіл); потім переводим кожен елемент списку в інтеджер

# result = 1

# for n in numbers:
#     result *= n
# print(result)


#варіант вирішення через while:

# numbers = list(map(int, input("Enter list:").split())) 
# n = 0
# result = 1
# while n < len(numbers):
#     result *= numbers[n]
#     n += 1

# print(result)


# 13
# апишіть програму для друку елементів певного цілочисельного списку після видалення з нього парних чисел. Значення списку вводяться через пропуск в одному рядку.

# Вхідні дані:
# 3 44 6 8 9 12 7

# Вихідні дані:
# [3, 9, 7]


# 14
# Напишіть програму, яка приймає послідовність 4-цифрових двійкових чисел, розділених комами, і друкує числа, які ділиться на 5 без остачі, в рядку і розділені комами.

# Вхідні дані:
# 0100,0011,1010,1001,1100

# Вихідні дані:
# 1010


# 15
# Ви вирішили написати перетворювач коду на Python в код на Java. Так як на Java прийнятий стандарт найменування CamelCase, то ви вирішили навчитися перетворювати імена з underscore в цей формат. Стиль underscore характеризується тим, що слова в імені пишуться маленькими літерами і розділяються між собою символом підкреслення _. Стиль CamelCase означає, що кожне слово пишеться з великої літери і роздільників між словами немає. Отже, вводиться один рядок, що містить ім’я, записане в форматі underscore. Програма виводить рядок, що містить ім’я в форматі CamelCase.

# Вхідні дані:
# my_class
# c

# Вихідні дані:
# MyClass
# C



# 16
# Напишіть програму для видалення кожного третього елемента із цілочисельного списку і друку результуючого списку, доки список не стане порожнім. Початковий список цілих чисел вводиться в одному рядку через пропуск.

# Вхідні дані:
# 2 5 8 9 4 78 7 1

# Вихідні дані:
# [2, 5, 9, 4, 78, 7, 1]
# [2, 5, 4, 78, 7, 1]
# [2, 5, 78, 7, 1]
# [2, 5, 7, 1]
# [2, 5, 1]
# [2, 5]
# [5]
# []

#вариант 1:

# numbers = list(map(int, input("Enter list:").split()))

# index = 2

# #while len(numbers) > index:
# while numbers:
#     index = 4
#     index %= len(numbers)
#     numbers.pop(index)

#     print(numbers)

#варіант 2


# 17
# Користувач вводить два цілих додатних числа n і m. Напишіть програму, яка створює двовимірний масив розміром n x m і заповнює його символами . і * у шаховому порядку (як у вихідних даних). Лівий верхній кут повинен мати символ ..

# Вхідні дані:
# 6 8

# Вихідні дані:
# . * . * . * . *
# * . * . * . * .
# . * . * . * . *
# * . * . * . * .
# . * . * . * . *
# * . * . * . * .

# n = int(input("n: "))
# m = int(input("m: "))

# for row in range(n):
#     for col in range(m):
#         if (row + col) % 2 == 0:
#             print(".", end=" ")
#         else:
#             print("*", end=" ")
#     #     print(row, col)
#         # print(col, end=" ")
#     print("\n")

# Hard level

# 18
# У рядку через кому перераховані слова. Сформувати з цих слів новий рядок. Слова мають бути відсортовані за спаданням (від Z до A) без урахування регістру і записані через пропуск.

# Вхідні дані:
# horse, cat, parrot, goldfish, dog

# Вихідні дані:
# parrot horse goldfish dog cat



#19
#  Напишіть програму, яка виводить частину послідовності 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5... (число повторюється стільки разів, чому дорівнює). На вхід програми передається невід’ємне ціле число n - стільки елементів послідовності повинна надрукувати програма. На виході очікується послідовність чисел, записаних через пропуск в один рядок.

# Вхідні дані:
# 8

# Вихідні дані:
# 1 2 2 3 3 3 4 4


# 20
# Використовуючи поняття списку, напишіть програму, яка створює 3D масив елементів a x b x c, кожен з яких має значення 0. Значення a, b, c вводяться в одному рядку через пропуск.

# Вхідні дані:
# 3 3 2
# 4 4 4

# Вихідні дані:
# [[[0, 0], [0, 0], [0, 0]], [[0, 0], [0, 0], [0, 0]], [[0, 0], [0, 0], [0, 0]]]
# [[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]]]

# n = int(input("n: "))
# m = int(input("m: "))

# result_list = []

# for row in range(n):
#     m_list = [] 
#     for col in range(m):
#         if (row + col) % 2 == 0:
#             m_list.append(".")
#         else:
#             m_list.append("*")
#     result_list.append(m_list)

# print(result_list)

#21
#  В один ряд поставили n кеглів, пронумерувавши їх зліва направо числами від 1 до n. Потім в цей ряд кинули k куль, при цьому i-та куля збила всі кеглі з номерами від m до h включно. Визначте, які кеглі залишилися стояти на місці. Програма отримує на вхід кількість кеглів n і кількість кидків k. Далі йде k пар чисел m, h, при цьому 1 ≤ m ≤ h ≤ n ≤ 100. Програма повинна вивести послідовність з n символів, де j-й символ є I, якщо j-та кегля залишилася стояти, або ., якщо j-та кегля була збита.

# Вхідні дані:
# 10 3
# 8 10
# 2 5
# 3 6

# Вихідні дані:
# I.....I...
